---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.DebugLevelsInOptionsError
source: html/d2813301-d7f2-8985-2b55-e488d6fb54b5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.DebugLevelsInOptionsError Property

This is an internal diagnostic message.

## Syntax (C#)
```csharp
public static FailureDefinitionId DebugLevelsInOptionsError { get; }
```